app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools"
---
  def find_tools_matching_keyword(search_term)
    search_term.downcase!
    tools = Tool.all