app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", ""]]
INSERT INTO "users" ("email", "first_name", "last_name", "image", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    p params
    if user = User.find_by(email: params[:email])
      render json: {message: "User already exist", user_id: user.id}
    else
      user = User.create(email: params[:email], first_name: params[:first_name], last_name: params[:last_name])